AUTO_config_TK_pesok/src/DataProcessors/ТК_АнкетированиеПоЧекам/ТК_АнкетированиеПоЧекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТК_АнкетированиеПоЧекам</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/Documents/Анкета/Анкета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Анкета</name>
  <registerRecords>InformationRegister.ОтветыНаВопросыАнкет</registerRecords>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Опрос</name>
    <type>
      <types>DocumentRef.НазначениеОпросов</types>
    </type>
  </attributes>
  <attributes>
    <name>Респондент</name>
    <type>
      <types>DefinedType.Респондент</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРедактирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактируемыйРаздел</name>
    <type>
      <types>CatalogRef.ВопросыШаблонаАнкеты</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Интервьюер</name>
    <type>
      <types>DefinedType.Интервьюер</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонАнкеты</name>
    <type>
      <types>CatalogRef.ШаблоныАнкет</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимАнкетирования</name>
    <type>
      <types>EnumRef.РежимыАнкетирования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыШаблонаАнкеты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементарныйВопрос</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЯчейки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответ</name>
      <type>
        <types>Characteristic.ВопросыДляАнкетирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ОткрытыйОтвет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/ШаблоныАнкет/ШаблоныАнкет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныАнкет</name>
  <basedOn>ChartOfCharacteristicTypes.ВопросыДляАнкетирования</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вступление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеШаблонаЗавершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Премии</name>
    <attributes>
      <name>ПодразделениеКомпании</name>
      <comment>Подразделение компании в котором был выписан документ</comment>
      <type>
        <types>CatalogRef.ПодразделенияКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/СкладыКомпании/СкладыКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкладыКомпании</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение компании, к которому относится склад компании</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенСебестоимости</name>
    <comment>Тип цен из которых считается себестоимость когда не найдены партии при возвратах и прочих оприходованиях</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРозничнойТорговли</name>
    <comment>Тип цен розничной торговли (для розничного склада)</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Розничный</name>
    <comment>Истина - склад розничный, иначе - оптовый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСклада</name>
    <type>
      <types>CatalogRef.ВидыСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Районы</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВестиУчетПоХарактеристикам</name>
    <comment>Устаревший, использовать вместо регистр &quot;ТК_УчетХарактеристикНаСкладах&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Global_ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>(АСУ by 4ок)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <comment>Номер маршрута доставки (0 если склад не торгует)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АссортиментнаяМатрица</name>
    <type>
      <types>CatalogRef.АссортиментнаяМатрица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерриторияПоКОАТУУ</name>
    <comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</comment>
    <type>
      <types>CatalogRef.КлассификаторКОАТУУ</types>
    </type>
  </attributes>
  <attributes>
    <name>НеАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСкладТорговойПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийСклад</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_Автомата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвтомата</name>
    <type>
      <types>CatalogRef.ВидыВендингАвтоматов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеЦены</name>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>240</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УточнениеНаименования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <comment>Дата регистрации</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСлужебное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоДРФО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКассир</name>
    <comment>Признак того, что сотрудник является кассиром</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинНаКассу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаКассу</name>
    <comment>Пароль на кассу, если установлен, то сотрудник является кассиром</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихКодНаКассу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильКассира</name>
    <type>
      <types>CatalogRef.ПрофилиКассиров</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ТК_АнкетированиеПоЧекам/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = НачалоДня(ТекущаяДата() - 24*60*60);
	СписокОбновлен = Ложь;
	Пользователь = Пользователи.ТекущийПользователь();
	
	ПолучитьНастройкиКомпоновщикаПоУмолчанию();
	
	СтруктураШаблоновАнкет = Новый Структура;
	СтруктураШаблоновАнкет.Вставить("КИОСК_НАЛИЧНЫЙ", 		Справочники.ШаблоныАнкет.НайтиПоКоду("000000001")); 
	СтруктураШаблоновАнкет.Вставить("КИОСК_БЕЗНАЛИЧНЫЙ", 	Справочники.ШаблоныАнкет.НайтиПоКоду("000000004")); 
	СтруктураШаблоновАнкет.Вставить("ПАВИЛЬОН_НАЛИЧНЫЙ", 	Справочники.ШаблоныАнкет.НайтиПоКоду("000000002")); 
	СтруктураШаблоновАнкет.Вставить("ПАВИЛЬОН_БЕЗНАЛИЧНЫЙ", Справочники.ШаблоныАнкет.НайтиПоКоду("000000003")); 
	СтруктураШаблоновАнкет.Вставить("ОБЩИЙ_01_05_2023", 	Справочники.ШаблоныАнкет.НайтиПоКоду("000000005"));
	СтруктураШаблоновАнкет.Вставить("ОБЩИЙ_01_11_2023",		Справочники.ШаблоныАнкет.НайтиПоКоду("000000007"));
	СтруктураШаблоновАнкет.Вставить("ОБЩИЙ_01_09_2024",		Справочники.ШаблоныАнкет.НайтиПоКоду("000000009"));
	
	СтруктураШаблоновАнкет.Вставить("АкционныйТовар",		Справочники.ШаблоныАнкет.НайтиПоКоду("000000010"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоказатьПараметрыЧека();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы 

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СписокОбновлен = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧековПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ПоказатьПараметрыЧека", 0.3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДопАнкетуПриИзменении(Элемент)
	
	УстановитьВидимостьДопШаблона();
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы

&НаСервере
Процедура ОбновитьСписокЧековНаСервере()
	
	ДанныеТочки = ПолучитьДанныеТочки(Склад);
	
	ЕстьОтбор = Не ПустаяСтрока(Строка(КомпоновщикНастроек.Настройки.Отбор));
	
	втТаблица = Новый ТаблицаЗначений;
	втТаблица.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	втТаблица.Колонки.Добавить("РК", ОбщегоНазначения.ОписаниеТипаСтрока(123));
	втТаблица.Колонки.Добавить("Чек", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	втТаблица.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	втТаблица.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(255));
	втТаблица.Колонки.Добавить("Уп", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	втТаблица.Колонки.Добавить("Кол", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
	втТаблица.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	втТаблица.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
	втТаблица.Колонки.Добавить("Возврат", Новый ОписаниеТипов("Булево"));
	втТаблица.Колонки.Добавить("ТипОплаты", ОбщегоНазначения.ОписаниеТипаСтрока(11));
	втТаблица.Колонки.Добавить("ИннКассира", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	втТаблица.Колонки.Добавить("ИД_Чек", ОбщегоНазначения.ОписаниеТипаСтрока(255));
		
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", ДанныеТочки.Код);
	
	Если ОбменФронтПовтИсп.ЭтоПодрзаделениеБафит(ДанныеТочки.Подразделение) Тогда 
		ТаблицаПродаж = "ProdaziKiev";
	ИначеЕсли ОбменФронтПовтИсп.ЭтоПодразделениеФабрикаСыра(ДанныеТочки.Подразделение) Тогда 
		ТекстСообщения = "";
		Успешно = ОбменФронт.УстановитьПодключениеКВнешнемуИсточнику(Ложь,ДанныеТочки.Подразделение,ТекстСообщения);
		
		Если Не Успешно Тогда
			ЗаписьЖурналаРегистрации("Анкетирование",УровеньЖурналаРегистрации.Информация,,,"Соеденение не установлено "+ТекстСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Соединение не установлено: '; uk = 'З''єднання не встановлено: '") + ТекстСообщения);
		КонецЕсли;
		
		ТаблицаПродаж = "OpenStore";
	Иначе
		ТаблицаПродаж = "ОпПродажи";
	КонецЕсли;		
	
		
	Если ТаблицаПродаж = "OpenStore" Тогда 
		Запрос.УстановитьПараметр("Дата", Дата);
	Иначе
		Запрос.УстановитьПараметр("Дата", Формат(Дата, "ДФ=yyyy-MM-dd"));
	КонецЕсли;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	dbo_vRCPTS.Дата КАК Дата,
	               |	dbo_vRCPTS.Время КАК Время,
	               |	dbo_vRCPTS.PK КАК РК,
	               |	dbo_vRCPTS.Чек_ КАК Чек,
	               |	dbo_vRCPTS.Артикул КАК Артикул,
	               |	dbo_vRCPTS.Наименование КАК Наименование,
	               |	dbo_vRCPTS.Уп КАК Уп,
	               |	dbo_vRCPTS.Кол КАК Кол,
	               |	dbo_vRCPTS.Цена КАК Цена,
	               |	dbo_vRCPTS.Сумма КАК Сумма,
	               |	dbo_vRCPTS.Отмена КАК Отмена,
	               |	dbo_vRCPTS.Возврат КАК Возврат,
	               |	dbo_vRCPTS.ТипОплаты КАК ТипОплаты,
	               |	dbo_vRCPTS.ИннКассира КАК ИннКассира
	               |ИЗ
	               |	ВнешнийИсточникДанных."+ТаблицаПродаж+".Таблица.dbo_vRCPTS КАК dbo_vRCPTS
	               |ГДЕ
	               |	dbo_vRCPTS.Склад = &Склад
	               |	И dbo_vRCPTS.Дата = &Дата
	               |	И НЕ dbo_vRCPTS.Отмена";
		
	Если ЕстьОтбор Тогда 
		МассивРК = ПолучитьМассивРКПоОтбору(Запрос, ТаблицаПродаж);
		Запрос.УстановитьПараметр("МассивРК", МассивРК);
		ТекстЗапроса = ТекстЗапроса + " И dbo_vRCPTS.PK В(&МассивРК)";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = втТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка, "РК,Чек,Артикул,Наименование,Уп,Кол,Цена,Возврат,ТипОплаты,ИннКассира");
				
		Если ТипЗнч(Выборка.Дата) = Тип("Дата") Тогда 
			ТекДата = Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		Иначе
			ТекДата = Выборка.Дата;	
		КонецЕсли;
		
		НоваяСтрока.Дата = СтроковыеФункцииКлиентСервер.СтрокаВДату(ТекДата + " " + Выборка.Время, ЧастиДаты.ДатаВремя);
		НоваяСтрока.Сумма = Выборка.Сумма * ?(Выборка.Возврат, -1, 1);
		НоваяСтрока.ИД_Чек = Выборка.РК + "&" + Выборка.Чек + "&" + Формат(Выборка.Дата, "ДФ=ддММггччммсс");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("втТаблица", втТаблица);
	Запрос.Текст = "ВЫБРАТЬ
	               |	dbo_vRCPTS.Дата КАК Дата,
	               |	dbo_vRCPTS.РК КАК РК,
	               |	dbo_vRCPTS.Чек КАК Чек,
	               |	dbo_vRCPTS.Артикул КАК Артикул,
	               |	dbo_vRCPTS.Наименование КАК Наименование,
	               |	dbo_vRCPTS.Уп КАК Уп,
	               |	dbo_vRCPTS.Кол КАК Кол,
	               |	dbo_vRCPTS.Цена КАК Цена,
	               |	dbo_vRCPTS.Сумма КАК Сумма,
	               |	dbo_vRCPTS.Возврат КАК Возврат,
	               |	dbo_vRCPTS.ТипОплаты КАК ТипОплаты,
	               |	dbo_vRCPTS.ИннКассира КАК ИннКассира,
	               |	dbo_vRCPTS.ИД_Чек КАК ИД_Чек
	               |ПОМЕСТИТЬ втТаблица
	               |ИЗ
	               |	&втТаблица КАК dbo_vRCPTS
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблица.Артикул КАК Артикул,
	               |	втТаблица.Наименование КАК Наименование,
	               |	втТаблица.Уп КАК Уп,
	               |	втТаблица.Кол КАК Кол,
	               |	втТаблица.Цена КАК Цена,
	               |	втТаблица.Сумма КАК Сумма,
	               |	втТаблица.Дата КАК Дата,
	               |	втТаблица.РК КАК РК,
	               |	втТаблица.Чек КАК Чек,
	               |	втТаблица.ИД_Чек КАК ИД_Чек
	               |ИЗ
	               |	втТаблица КАК втТаблица
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата,
	               |	Чек
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТаблица.Дата КАК Дата,
	               |	втТаблица.РК КАК РК,
	               |	втТаблица.Чек КАК Чек,
	               |	МАКСИМУМ(втТаблица.Возврат) КАК Возврат,
	               |	МАКСИМУМ(втТаблица.ТипОплаты) КАК ТипОплаты,
	               |	МАКСИМУМ(втТаблица.ИннКассира) КАК ИннКассира,
	               |	СУММА(втТаблица.Сумма) КАК СуммаЧека,
	               |	втТаблица.ИД_Чек КАК ИД_Чек
	               |ИЗ
	               |	втТаблица КАК втТаблица
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТаблица.Дата,
	               |	втТаблица.РК,
	               |	втТаблица.Чек,
	               |	втТаблица.ИД_Чек
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	тчТовары = МассивРезультатов[1].Выгрузить();
	Товары.Загрузить(тчТовары);
	
	ВыборкаЧеки = МассивРезультатов[2].Выбрать();
	СписокЧеков.Очистить();
	
	Пока ВыборкаЧеки.Следующий() Цикл 
		НоваяСтрока = СписокЧеков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаЧеки, "Дата,РК,Чек,СуммаЧека,Возврат,ТипОплаты,ИннКассира,ИД_Чек");
		
		НоваяСтрока.Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										"Чек №%1 от %2",
										ВыборкаЧеки.Чек,
										ВыборкаЧеки.Дата);
		
	КонецЦикла;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЧеков(Команда)
	
	ОчиститьСообщения();
	СписокЧеков.Очистить();
	Товары.Очистить();
	КешКассиров.Очистить();
	
	Если ПроверитьЗаполнение() Тогда 
		ОбновитьСписокЧековНаСервере();
		СписокОбновлен = Истина;
		РеквизитыТочкиОбновлены = Ложь;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура НачатьАнкетированиеНаСервере()
	
	ТорговаяПлощадка = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(Склад);	
	ТекДата = ТекущаяДата();
	//Создаем сначала назначение опросов		
	
	// - проверка есть ли уже созданное Назначение опросов	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	НазначениеОпросовРеспонденты.Ссылка КАК НазначениеОпроса,
	               |	ВЫБОР
	               |		КОГДА НЕ Анкета.Ссылка ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ОпросПроведен
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.НазначениеОпросов.Респонденты КАК НазначениеОпросовРеспонденты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Анкета КАК Анкета
	               |		ПО НазначениеОпросовРеспонденты.Ссылка = Анкета.Опрос
	               |			И НазначениеОпросовРеспонденты.Респондент = Анкета.Респондент
	               |			И (Анкета.Респондент ССЫЛКА Справочник.ТорговыеПлощадки)
	               |			И (Анкета.Проведен)
	               |			И (НЕ Анкета.ПометкаУдаления)
	               |ГДЕ
	               |	НазначениеОпросовРеспонденты.Респондент = &ТорговаяПлощадка
	               |	И НазначениеОпросовРеспонденты.Респондент ССЫЛКА Справочник.ТорговыеПлощадки
	               |	И НазначениеОпросовРеспонденты.Ссылка.ДатаНачала <= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И НазначениеОпросовРеспонденты.Ссылка.ДатаОкончания >= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	               |	И НазначениеОпросовРеспонденты.Ссылка.Проведен
	               |	И НЕ НазначениеОпросовРеспонденты.Ссылка.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.НазначениеОпроса КАК НазначениеОпроса
	               |ИЗ
	               |	ВТ КАК ВТ
	               |ГДЕ
	               |	НЕ ВТ.ОпросПроведен";
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		НазначениеОпроса = Выборка.НазначениеОпроса;		
	Иначе				
		Если Не ЗначениеЗаполнено(ШаблонАнкеты) Тогда 
			ОбщегоНазначения.СообщитьПользователю("Не удалось обнаружить шаблон анкеты");			
			Возврат;
		КонецЕсли;
		
		обНазначениеОпроса = Документы.НазначениеОпросов.СоздатьДокумент();	
		обНазначениеОпроса.Дата = чДата;
		обНазначениеОпроса.ШаблонАнкеты = ШаблонАнкеты;
		обНазначениеОпроса.ДатаНачала = НачалоДня(чДата);
		обНазначениеОпроса.ДатаОкончания = КонецДня(ТекДата);
		обНазначениеОпроса.ВозможностьПредварительногоСохранения = Ложь;
		обНазначениеОпроса.Наименование = "Оценка работы точки от " + ТекДата; 
		обНазначениеОпроса.ПоказыватьВАрхивеАнкет = Истина;
		обНазначениеОпроса.Комментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = 'Создано обработкой ""Анкетирование по чекам"".
                                                  |Дата создания: %1;
                                                  |Пользватель; %2
                                                  |Чек: %3
                                                  |Дата чека: %4'"),
											ТекДата,
											Пользователи.ТекущийПользователь());
											
		НоваяСтрока = обНазначениеОпроса.Респонденты.Добавить();											
		НоваяСтрока.Респондент = ТорговаяПлощадка;
		
		Если Не обНазначениеОпроса.ПроверитьЗаполнение() Тогда 
			ОбщегоНазначения.СообщитьПользователю("Создание анкеты отменено!");
			Возврат;
		КонецЕсли;
				
		Попытка
			обНазначениеОпроса.Записать(РежимЗаписиДокумента.Проведение);						
			НазначениеОпроса = обНазначениеОпроса.Ссылка;
		Исключение
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка создания анкеты:
                          |%1'"),
					ОписаниеОшибки()));
			Возврат;
		КонецПопытки;	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьАнкетирование(Команда)
	Отказ = Ложь;
	
	ОчиститьСообщения();
	
	Если ТорговаяПлощадка.Пустая() Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'У склада ""%1"" не заполнен реквизит ""Торговая площадка""'; uk = 'Для складу ""%1"" не заповнений реквізит ""Торговий майданчик""'"),
				Склад),
			Склад,
			"Склад",, 
			Отказ);
	КонецЕсли;
			
	Если ШаблонАнкеты.Пустая() Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран шаблон анкеты'; uk = 'Не обраний шаблон анкети'"),,"ШаблонАнкеты",,Отказ); 			
	КонецЕсли;
	
	Если ИспользоватьДопАнкету И ШаблонАнкетыДоп.Пустая() Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбран дополнительный шаблон анкеты'; uk = 'Не обраний додатковий шаблон анкети'"),,"ШаблонАнкетыДоп",,Отказ);
	КонецЕсли;
	
	Если Не Отказ И ИспользоватьДопАнкету И ШаблонАнкеты = ШаблонАнкетыДоп Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Шаблон ""%1"" уже используется в роли основного'; uk = 'Шаблон ""%1"" вже використовується в якості головного'"),
				СокрЛП(Строка(ШаблонАнкетыДоп))),,
			"ШаблонАнкетыДоп",,
			Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда 
		//АнкетированиеКлиент.НачатьИнтервью(ТорговаяПлощадка, ШаблонАнкеты);	
		//НачатьИнтервью(ТорговаяПлощадка, ШаблонАнкеты);
		НачатьИнтервьюВОбработке();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область ПрочиеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьПараметрыЧека()
	
	ТекущаяСтрока = Элементы.СписокЧеков.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустыеДанные;
		Возврат;
	КонецЕсли;
		
	Отбор = Новый Структура;
	Отбор.Вставить("ИД_Чек", ТекущаяСтрока.ИД_Чек);
	
	Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
	чДата = ТекущаяСтрока.Дата;
	чВозврат = ТекущаяСтрока.Возврат;
	чТипОплаты = ТекущаяСтрока.ТипОплаты;
	чСуммаЧека = ТекущаяСтрока.СуммаЧека; 
	чКассир = ПолучитьКассира(ТекущаяСтрока.ИннКассира);
	
	Если СписокОбновлен И Не РеквизитыТочкиОбновлены Тогда
		чСклад = Склад;
		
		Если ДанныеТочки = Неопределено Тогда 
			ДанныеТочки = Новый Структура;
		КонецЕсли;
		
		ТорговаяПлощадка 	= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТочки, "ТорговаяПлощадка", Неопределено);	
		чТипТочки 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТочки, "Вид", "");
		чКуратор 			= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТочки, "Куратор", "");
		чГрафикРаботы 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТочки, "ГрафикРаботы", "");		
		УчастиеВПрограммеФМ = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТочки, "ПрограммаФМ", Ложь);		
		
		ТекстПроверки 		= ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТочки, "Проверка", "");
		Если Не ПустаяСтрока(ТекстПроверки) Тогда 
			Элементы.ГруппаНадписьРезультатАнкетирования.Видимость = Истина;
			Элементы.НадписьРезультатПрошлойПроверки.Заголовок = ТекстПроверки;
		Иначе
			Элементы.ГруппаНадписьРезультатАнкетирования.Видимость = Ложь;
		КонецЕсли;
		
		РеквизитыТочкиОбновлены = Истина;
	КонецЕсли;
	
	ВремяЧека = Час(чДата);
	
	Если ВремяЧека >= 7 И ВремяЧека < 21 Тогда
		чСмена = "День";
	Иначе
		чСмена = "Ночь";
	КонецЕсли;
	
	Если НачалоДня(Дата) >= Дата("20240901") Тогда 
		ШаблонАнкеты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураШаблоновАнкет, "ОБЩИЙ_01_09_2024", ПредопределенноеЗначение("Справочник.ШаблоныАнкет.ПустаяСсылка"));
	ИначеЕсли Дата >= Дата("20231101") Тогда
		ШаблонАнкеты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураШаблоновАнкет, "ОБЩИЙ_01_11_2023", ПредопределенноеЗначение("Справочник.ШаблоныАнкет.ПустаяСсылка"));
	ИначеЕсли Дата > Дата("20230101") Тогда 
		ШаблонАнкеты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураШаблоновАнкет, "ОБЩИЙ_01_05_2023", ПредопределенноеЗначение("Справочник.ШаблоныАнкет.ПустаяСсылка"));
	Иначе
		ИД_Шаблона = ВРег(Строка(чТипТочки)) + "_" + ВРег(ТекущаяСтрока.ТипОплаты);
		ШаблонАнкеты = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураШаблоновАнкет, ИД_Шаблона, ПредопределенноеЗначение("Справочник.ШаблоныАнкет.ПустаяСсылка"));
	КонецЕсли;
	
	ИспользоватьДопАнкету = Ложь; //Принудительно сбрасываем опцию
	УстановитьВидимостьДопШаблона();
	ШаблонАнкетыДоп = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(СтруктураШаблоновАнкет, "АкционныйТовар", ПредопределенноеЗначение("Справочник.ШаблоныАнкет.ПустаяСсылка"));
	
	Элементы.ЗаголовокЧека.Заголовок = ТекущаяСтрока.Представление;	
		
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДанныеЧека;
	      
КонецПроцедуры


&НаКлиенте
Функция ПолучитьКассира(Знач ИНН)
	
	мСтроки = КешКассиров.НайтиСтроки(Новый Структура("ИНН", ИНН));
	
	Если мСтроки.Количество() > 0 Тогда 
		Кассир = мСтроки[0].Кассир;
	Иначе
		Кассир = ПолучитьСотрудникаПоИНН(ИНН);
		
		НовыйКассир = КешКассиров.Добавить();
		НовыйКассир.ИНН = ИНН;
		НовыйКассир.Кассир = Кассир;
	КонецЕсли;
	
	Возврат Кассир;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСотрудникаПоИНН(Знач ИНН)
	
	Кассир = Справочники.ФизическиеЛица.НайтиПоКоду(ИНН);
	
	Если Кассир.Пустая() Тогда 
		Кассир = "Кассир ИНН: " + ИНН;
	КонецЕсли;
	
	Возврат Кассир; 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеТочки(Знач Склад)
	
	СтруктураРеквизитов = Новый Структура;
	
	Если ЗначениеЗаполнено(Склад) Тогда 
		УстановитьПривилегированныйРежим(Истина);
		
		ТорговаяПлощадка = Справочники.СкладыКомпании.ТорговаяПлощадкаСклада(Склад);				
		СтруктураРеквизитов.Вставить("ТорговаяПлощадка", ТорговаяПлощадка);
		СтруктураРеквизитов.Вставить("Подразделение", Склад.Подразделение);
		СтруктураРеквизитов.Вставить("Код", Склад.Код);
		
		ТаблицаРеквизитов = УправлениеСвойствами.ЗначенияСвойств(ТорговаяПлощадка, Истина, Ложь);
		
		Для Каждого Стр Из ТаблицаРеквизитов Цикл 
			Если Не ЗначениеЗаполнено(Стр.Значение) Тогда 
				Продолжить;
			КонецЕсли;
			
			ИмяСвойства = Стр.Свойство.Имя;
			
			Если ИмяСвойства = "КураторПлощадки" Тогда 
				СтруктураРеквизитов.Вставить("Куратор", Стр.Значение);
			ИначеЕсли ИмяСвойства = "ВидПлощадки" Тогда 
				СтруктураРеквизитов.Вставить("Вид", Стр.Значение);
			ИначеЕсли ИмяСвойства = "ГрафикРаботы" Тогда 
				СтруктураРеквизитов.Вставить("ГрафикРаботы", Стр.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Анкета.Дата КАК Дата,
		               |	РАЗНОСТЬДАТ(Анкета.Дата, &ТекДата, ДЕНЬ) КАК Период,
		               |	Анкета.Комментарий КАК Комментарий
		               |ИЗ
		               |	Документ.Анкета КАК Анкета
		               |ГДЕ
		               |	Анкета.Проведен
		               |	И Анкета.Респондент ССЫЛКА Справочник.ТорговыеПлощадки
		               |	И Анкета.Респондент = &ТорговаяПлощадка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Анкета.Дата УБЫВ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Значение
		               |ИЗ
		               |	Справочник.ТорговыеПлощадки.ДополнительныеРеквизиты КАК ТорговыеПлощадкиДополнительныеРеквизиты
		               |ГДЕ
		               |	ТорговыеПлощадкиДополнительныеРеквизиты.Ссылка = &ТорговаяПлощадка
		               |	И ТорговыеПлощадкиДополнительныеРеквизиты.Свойство.Имя = ""ПартнерскаяПрограмма""
		               |	И ТорговыеПлощадкиДополнительныеРеквизиты.Значение ССЫЛКА Справочник.ЗначенияСвойствОбъектов
		               |			И ВЫРАЗИТЬ(ТорговыеПлощадкиДополнительныеРеквизиты.Значение КАК Справочник.ЗначенияСвойствОбъектов).Наименование = ""ФМУ""";
		
		Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
		Запрос.УстановитьПараметр("ТорговаяПлощадка", ТорговаяПлощадка);				
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		Результат = МассивРезультатов[0];
		РезультатФМ = МассивРезультатов[1];		
		
		РезультатПрошлойПроверки = "";
		Если Результат.Пустой() Тогда 
			РезультатПрошлойПроверки = НСтр("ru = 'Точка еще не участвовала в анкетировании'; uk = 'Точка ще не приймала участь у анкетуванні'");
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
						
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.Комментарий, Символы.ПС, Истина, Истина);
			МассивПроверки = Новый Массив;
			Для Каждого Подстрока Из МассивПодстрок Цикл 
				НачалоСтроки = НРег(Лев(СокрЛП(Подстрока), 3));
				
				//Если НачалоСтроки = "чек" 
				Если НачалоСтроки = "кас" Тогда 				
					МассивПроверки.Добавить(Подстрока);
				КонецЕсли;
			КонецЦикла;
			
			РезультатПрошлойПроверки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
											НСтр("ru = 'Последняя проверка %1 (%2 дней назад)'; uk = 'Остання перевірка %1 (%2 днів назад)'"),
											Выборка.Дата,
											Выборка.Период);
											
			Если МассивПроверки.Количество() > 0 Тогда 
				Для Каждого Подстрока Из МассивПроверки Цикл 
					РезультатПрошлойПроверки = РезультатПрошлойПроверки + Символы.ПС + Подстрока;
				КонецЦикла;
			КонецЕсли;									
		КонецЕсли;
		
		СтруктураРеквизитов.Вставить("Проверка", РезультатПрошлойПроверки);
		
		Если Не РезультатФМ.Пустой() Тогда 
			СтруктураРеквизитов.Вставить("ПрограммаФМ", Истина);	
		КонецЕсли;
		
		//ВидТочки = Неопределено;
		//Если СтруктураРеквизитов.Свойство("Вид", ВидТочки) Тогда 						
		//	стрВидТочки = СокрЛП(ВидТочки.Наименование);
		//	ШаблонАнкеты = Неопределено;
		//	Если стрВидТочки = "Киоск" Тогда 
		//		ШаблонАнкеты = Справочники.ШаблоныАнкет.НайтиПоКоду("000000001");
		//	ИначеЕсли стрВидТочки = "Павильон" Тогда 
		//		ШаблонАнкеты = Справочники.ШаблоныАнкет.НайтиПоКоду("000000002");
		//	КонецЕсли;
		//	
		//	Если ЗначениеЗаполнено(ШаблонАнкеты) Тогда 
		//		СтруктураРеквизитов.Вставить("ШаблонАнкеты", ШаблонАнкеты);
		//	КонецЕсли;
		//КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;

	Возврат СтруктураРеквизитов;
	
КонецФункции

&НаСервере
Процедура ПолучитьНастройкиКомпоновщикаПоУмолчанию()
	
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");			
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор)));	
	
	ВариантНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("САртикулом");
	Если ВариантНастройки = Неопределено Тогда 
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Иначе
		Настройки = ВариантНастройки.Настройки;
	КонецЕсли;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);			

КонецПроцедуры

&НаСервере
Функция ПолучитьМассивРКПоОтбору(Запрос, ТаблицаПродаж)
	
	СКД = ПолучитьОбщийМакет("СхемаКомпоновкиОтбораНоменклатуры");
	
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
	ПараметрыНастройки = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	//Получим макет компоновки    
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	
	//Через процессор компоновки получим результат
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных); 
	
	ТаблицаРезультат = Новый ТаблицаЗначений; 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
	
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	
	//МассивОтборов = ТаблицаРезультат.ВыгрузитьКолонку("Артикул");
	МассивАртикулов = Новый Массив;
	
	Для Каждого Стр Из ТаблицаРезультат Цикл 
		чАртикул = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(Стр.Артикул);
		Если ЗначениеЗаполнено(чАртикул) Тогда 
			МассивАртикулов.Добавить(чАртикул);
		КонецЕсли;
	КонецЦикла;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	dbo_vRCPTS.PK КАК РК
	               |ИЗ
	               |	ВнешнийИсточникДанных."+ТаблицаПродаж+".Таблица.dbo_vRCPTS КАК dbo_vRCPTS
	               |ГДЕ
	               |	dbo_vRCPTS.Склад = &Склад
	               |	И dbo_vRCPTS.Дата = &Дата
	               |	И НЕ dbo_vRCPTS.Отмена
	               |	И dbo_vRCPTS.Артикул В(&МассивАртикулов)";
	
	Запрос.УстановитьПараметр("МассивАртикулов", МассивАртикулов);
	Запрос.Текст = ТекстЗапроса;
	
	тзЧеки = Запрос.Выполнить().Выгрузить();
	
	Возврат тзЧеки.ВыгрузитьКолонку("РК");
	
КонецФункции

&НаКлиенте
Процедура НачатьИнтервью(Респондент, ШаблонАнкеты)
	
	ТекущаяСтрока = Элементы.СписокЧеков.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустыеДанные;
		Возврат;
	КонецЕсли;
	
	
	Комментарий = Новый ТекстовыйДокумент;
	Комментарий.ДобавитьСтроку(ТекущаяСтрока.Представление);
	Комментарий.ДобавитьСтроку("РК: "  + ТекущаяСтрока.РК);
	Комментарий.ДобавитьСтроку("Сумма: "  + Формат(чСуммаЧека, "ЧДЦ=2"));
	Комментарий.ДобавитьСтроку("Кассир: (" + ТекущаяСтрока.ИннКассира + ") " + чКассир);
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Респондент", Респондент);
	ЗначенияЗаполнения.Вставить("ШаблонАнкеты", ШаблонАнкеты);
	ЗначенияЗаполнения.Вставить("РежимАнкетирования", ПредопределенноеЗначение("Перечисление.РежимыАнкетирования.Интервью"));
	ЗначенияЗаполнения.Вставить("Дата", чДата);
	ЗначенияЗаполнения.Вставить("Комментарий", Комментарий.ПолучитьТекст());
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ПараметрыФормы.Вставить("ТолькоФормаЗаполнения", Истина);
	
	ФормаАнкеты = ОткрытьФорму("Документ.Анкета.ФормаОбъекта", ПараметрыФормы);
	
	Если ФормаАнкеты <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ФормаАнкеты, ЗначенияЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДопШаблона()
	
	Элементы.ШаблонАнкетыДоп.Видимость = ИспользоватьДопАнкету;
	
КонецПроцедуры

#КонецОбласти
 
#Область ИнтервьюВстроенное

&НаКлиенте
Процедура НачатьИнтервьюВОбработке()
	
	ТекущаяСтрока = Элементы.СписокЧеков.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаПустыеДанные;
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеТочки) = Тип("Структура") Тогда 
		Подразделение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеТочки, "Подразделение", Неопределено);
	Иначе
		Подразделение = Неопределено;
	КонецЕсли;
		
	Комментарий = Новый ТекстовыйДокумент;
	Комментарий.ДобавитьСтроку(ТекущаяСтрока.Представление);
	Комментарий.ДобавитьСтроку("РК: "  + ТекущаяСтрока.РК);
	Комментарий.ДобавитьСтроку("Сумма: "  + Формат(чСуммаЧека, "ЧДЦ=2"));
	Комментарий.ДобавитьСтроку("Кассир: (" + ТекущаяСтрока.ИннКассира + ") " + чКассир);	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", чДата);
	ПараметрыФормы.Вставить("Респондент", ТорговаяПлощадка);
	ПараметрыФормы.Вставить("ПодразделениеКомпании", Подразделение); 
	ПараметрыФормы.Вставить("Интервьюер", Пользователь);
	ПараметрыФормы.Вставить("ШаблонАнкеты", ШаблонАнкеты);
	ПараметрыФормы.Вставить("РежимАнкетирования", ПредопределенноеЗначение("Перечисление.РежимыАнкетирования.Интервью"));
	ПараметрыФормы.Вставить("Комментарий", Комментарий.ПолучитьТекст());
	ПараметрыФормы.Вставить("Реализатор", чКассир);
	
	Если ИспользоватьДопАнкету Тогда 	
		ПараметрыФормы.Вставить("ШаблонАнкетыДоп", ШаблонАнкетыДоп);
	КонецЕсли;
	
	Если ИспользоватьДопАнкету Тогда 
		ОписаниеЗакрытия = Новый ОписаниеОповещения("РезультатЗакрытияФормыАнкеты", ЭтаФорма, Неопределено);		
		ОткрытьФорму("Обработка.ТК_АнкетированиеПоЧекам.Форма.ФормаАнкеты", ПараметрыФормы, ЭтаФорма,,,, ОписаниеЗакрытия);
	Иначе
		ОткрытьФорму("Документ.Анкета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатЗакрытияФормыАнкеты(мРезультаты, ДопПараметры) Экспорт 
	
	Если ТипЗнч(мРезультаты) <> Тип("Массив") Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Результат Из мРезультаты Цикл 
		Если Результат.Свойство("Сообщение") Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(
			Результат.Сообщение,
			?(Результат.Свойство("Ссылка"), Результат.Ссылка, Неопределено));
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
